"""
Модуль со словарем соответствий на русском
"""
BUTTONS: dict[str, str] = {
    'fabric_cutting': 'Раскрой',
    'profile_cutting': 'Распил',
    'total_cutting': 'Раскрой и распил',
    'quick_calc': 'Быстрый расчет',
    'middle_calc': 'Точный расчет',
    'reset': 'Сбросить',
    'save': 'Сохранить'
}

FRAMES: dict[str, str] = {
    'simple_cut': 'Распил'
}

LABELS: dict[str, str] = {
    'input_products': 'Введите ширины изделий (как указано в наряде) (м):',
    'input_remnants': 'Введите ширины имеющихся остатков (м):',
    'input_correction': 'Введите поправку к ширине изделий (м):',
    'input_min_remnant': 'Введите минимальную длину остатка (м):',
    'input_whole_profile': 'Введите длину целого профиля (м):',
    'input_number_profiles': 'Введите количество целых профилей в наличии (шт):',
    'input_cutting_width': 'Введите ширину реза (м):',
    'text_result': 'Схема распила:',
    'total_waste': 'Суммарный отход (м):',
    'percent_waste': 'Процент отхода (%):'
}

ERROR_LABELS: dict[str, str] = {
    'error_input': 'Ошибка ввода параметра: ',
    'min_remnant': 'Минимальная длина остатка',
    'correction': 'Поправка к ширине изделия',
    'whole_profile': 'Длина целого профиля',
    'number_whole_profiles': 'Количество целых профилей должно быть целым числом!',
    'cut_width': 'Ширина реза',
    'float_error': 'Параметр должен быть вещественным числом (числом с плавающей точкой)!',
    'products': 'Ошибка ввода списка ширин ИЗДЕЛИЙ',
    'remnants': 'Ошибка ввода списка ширин ОСТАТКОВ'
}

TOOLTIPS: dict[str, str] = {
    'input_products': 'Перечислите ширины изделий, как указано в наряде.\n'
                      'Размеры пишутся в метрах, дробная часть пишется через точку,\n'
                      'размеры перечисляются  через пробел или с новой строки.\n'
                      'Пример:\n1.1 2.2 3.3\n4.4 5.5\n6.6',
    'input_remnants': 'Перечислите ширины имеющихся остатков.\n'
                      'Размеры пишутся в метрах, дробная часть пишется через точку,\n'
                      'размеры перечисляются через пробел или с новой строки.\n'
                      'Пример:\n1.1 2.2 3.3\n4.4 5.5\n6.6',
    'input_correction': 'Поправка к ширине - это величина, на которую размер длинной\n'
                        'детали отличается от размера изделия в наряде.\n'
                        'Дробное число необходимо ввести через точку.'
                        '\nНапример, ширина вертикального жалюзи в наряде равна 2.0 м.\n'
                        'Профиль для вертикальных жалюзи необходимо отрезать на 0.02 м короче, т.е. 1.98 м.\n'
                        'Эти 0.02 м и есть поправка.',
    'input_min_remnant': 'Остатки короче минимальной длины отправляются в отход.\n'
                         'Например, остатки профилей для вертикальных жалюзи,\n'
                         'короче 0.5 м идут в отход.\n'
                         '0.5 м в этом случае - минимальная длина остатка.',
    'input_whole_profile': 'Длина целого профиля.\n'
                           'Например, длина целого профиля для вертикальных жалюзи - 6 м',
    'input_number_profiles': 'Количество имеющихся (без браков) целых профилей',
    'input_cutting_width': 'Ширина реза - ширина разреза пилы.\n'
                           'Например, ширина разреза циркулярной пилы примерно равна 0.003 м'
}
